In [1]:
import sqlite3

# Conección a la base de datos

In [2]:
db_path = 'data/sqlite3/test.db'

In [3]:
! mkdir data
! mkdir data/sqlite3

A subdirectory or file data already exists.

The syntax of the command is incorrect.

In [4]:
conn = sqlite3.connect(db_path)

### Creación de una tabla (CREATE TABLE) ###

In [5]:
conn.execute('''CREATE TABLE COMPANY
         (ID INT PRIMARY KEY     NOT NULL,
         NAME           TEXT    NOT NULL,
         AGE            INT     NOT NULL,
         ADDRESS        CHAR(50),
         SALARY         REAL);''')

In [6]:
# Obtengo info de tabla
schema = conn.execute("""PRAGMA table_info(COMPANY);""")

In [7]:
for s in schema:
    print(s)

(0, 'ID', 'INT', 1, None, 1)
(1, 'NAME', 'TEXT', 1, None, 0)
(2, 'AGE', 'INT', 1, None, 0)
(3, 'ADDRESS', 'CHAR(50)', 0, None, 0)
(4, 'SALARY', 'REAL', 0, None, 0)

### Agregamos datos (INSERT)

In [8]:
N = 0
conn.execute(f"INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES ({N}, 'Paul', 32, 'California', 20000.00 )");

conn.execute(f"INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES ({N+1}, 'Allen', 25, 'Texas', 15000.00 )");

conn.execute(f"INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES ({N+2}, 'Teddy', 23, 'Norway', 20000.00 )");

conn.execute(f"INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES ({N+3}, 'Mark', 25, 'Rich-Mond ', 65000.00 )");

In [9]:
conn.commit()

In [10]:
conn.close()

### Seleccionamos datos (SELECT)

In [11]:
conn = sqlite3.connect(db_path)

In [12]:
cursor = conn.execute("SELECT id, name, address, salary from COMPANY")

In [13]:
records=cursor.fetchall()
print(records)

[(0, 'Paul', 'California', 20000.0), (1, 'Allen', 'Texas', 15000.0), (2, 'Teddy', 'Norway', 20000.0), (3, 'Mark', 'Rich-Mond ', 65000.0)]

In [14]:
for row in records:
   print("ID = ", row[0])
   print("NAME = ", row[1])
   print("ADDRESS = ", row[2])
   print("SALARY = ", row[3], "\n")

ID =  0
NAME =  Paul
ADDRESS =  California
SALARY =  20000.0

ID =  1
NAME =  Allen
ADDRESS =  Texas
SALARY =  15000.0

ID =  2
NAME =  Teddy
ADDRESS =  Norway
SALARY =  20000.0

ID =  3
NAME =  Mark
ADDRESS =  Rich-Mond
SALARY =  65000.0

### UPDATE

In [15]:
conn.execute("""UPDATE COMPANY set SALARY = 2000.00 where NAME = 'Allen'""")
conn.commit()
print("Total number of rows updated :", conn.total_changes)
# conn.close()
cursor = conn.execute("SELECT id, name, address, salary from COMPANY")
for row in cursor:
   print("ID = ", row[0])
   print("NAME = ", row[1])
   print("ADDRESS = ", row[2])
   print("SALARY = ", row[3], "\n")

Total number of rows updated : 1
ID =  0
NAME =  Paul
ADDRESS =  California
SALARY =  20000.0

ID =  1
NAME =  Allen
ADDRESS =  Texas
SALARY =  2000.0

ID =  2
NAME =  Teddy
ADDRESS =  Norway
SALARY =  20000.0

ID =  3
NAME =  Mark
ADDRESS =  Rich-Mond
SALARY =  65000.0

### DELETE

In [25]:
conn.execute("DELETE from COMPANY where ID = 1;")
conn.commit()

print("Total number of rows updated :", conn.total_changes)
# conn.close()
cursor = conn.execute("SELECT id, name, address, salary from COMPANY")
for row in cursor:
   print("ID = ", row[0])
   print("NAME = ", row[1])
   print("ADDRESS = ", row[2])
   print("SALARY = ", row[3], "\n")

Total number of rows updated : 2
ID =  0
NAME =  Paul
ADDRESS =  California
SALARY =  20000.0

ID =  2
NAME =  Teddy
ADDRESS =  Norway
SALARY =  20000.0

ID =  3
NAME =  Mark
ADDRESS =  Rich-Mond
SALARY =  65000.0

In [16]:
# Hasta aca para seguir con la siguiente Notebook
conn.close()

### DROP

In [27]:
conn = sqlite3.connect(db_path)
conn.execute("DROP TABLE COMPANY")
conn.commit()

In [28]:
conn.close()